Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256GM304.h
#define _IC7CON2_IC32_POSITION                   0x00000008
#define _IC7CON2_IC32_MASK                       0x00000100
#define _IC7CON2_IC32_LENGTH                     0x00000001

#define _IC7CON2_SYNCSEL0_POSITION               0x00000000
#define _IC7CON2_SYNCSEL0_MASK                   0x00000001
#define _IC7CON2_SYNCSEL0_LENGTH                 0x00000001

#define _IC7CON2_SYNCSEL1_POSITION               0x00000001
#define _IC7CON2_SYNCSEL1_MASK                   0x00000002
#define _IC7CON2_SYNCSEL1_LENGTH                 0x00000001

#define _IC7CON2_SYNCSEL2_POSITION               0x00000002
#define _IC7CON2_SYNCSEL2_MASK                   0x00000004
#define _IC7CON2_SYNCSEL2_LENGTH                 0x00000001

#define _IC7CON2_SYNCSEL3_POSITION               0x00000003
#define _IC7CON2_SYNCSEL3_MASK                   0x00000008
#define _IC7CON2_SYNCSEL3_LENGTH                 0x00000001

#define _IC7CON2_SYNCSEL4_POSITION               0x00000004
#define _IC7CON2_SYNCSEL4_MASK                   0x00000010
#define _IC7CON2_SYNCSEL4_LENGTH                 0x00000001

#define _IC8CON1_ICM_POSITION                    0x00000000
#define _IC8CON1_ICM_MASK                        0x00000007
#define _IC8CON1_ICM_LENGTH                      0x00000003

#define _IC8CON1_ICBNE_POSITION                  0x00000003
#define _IC8CON1_ICBNE_MASK                      0x00000008
#define _IC8CON1_ICBNE_LENGTH                    0x00000001

#define _IC8CON1_ICOV_POSITION                   0x00000004
#define _IC8CON1_ICOV_MASK                       0x00000010
#define _IC8CON1_ICOV_LENGTH                     0x00000001

#define _IC8CON1_ICI_POSITION                    0x00000005
#define _IC8CON1_ICI_MASK                        0x00000060
#define _IC8CON1_ICI_LENGTH                      0x00000002

#define _IC8CON1_ICTSEL_POSITION                 0x0000000A
#define _IC8CON1_ICTSEL_MASK                     0x00001C00
#define _IC8CON1_ICTSEL_LENGTH                   0x00000003

#define _IC8CON1_ICSIDL_POSITION                 0x0000000D
#define _IC8CON1_ICSIDL_MASK                     0x00002000
#define _IC8CON1_ICSIDL_LENGTH                   0x00000001

#define _IC8CON1_ICM0_POSITION                   0x00000000
#define _IC8CON1_ICM0_MASK                       0x00000001
#define _IC8CON1_ICM0_LENGTH                     0x00000001

#define _IC8CON1_ICM1_POSITION                   0x00000001
#define _IC8CON1_ICM1_MASK                       0x00000002
#define _IC8CON1_ICM1_LENGTH                     0x00000001

#define _IC8CON1_ICM2_POSITION                   0x00000002
#define _IC8CON1_ICM2_MASK                       0x00000004
#define _IC8CON1_ICM2_LENGTH                     0x00000001

#define _IC8CON1_ICI0_POSITION                   0x00000005
#define _IC8CON1_ICI0_MASK                       0x00000020
#define _IC8CON1_ICI0_LENGTH                     0x00000001

#define _IC8CON1_ICI1_POSITION                   0x00000006
#define _IC8CON1_ICI1_MASK                       0x00000040
#define _IC8CON1_ICI1_LENGTH                     0x00000001

#define _IC8CON1_ICTSEL0_POSITION                0x0000000A
#define _IC8CON1_ICTSEL0_MASK                    0x00000400
#define _IC8CON1_ICTSEL0_LENGTH                  0x00000001

#define _IC8CON1_ICTSEL1_POSITION                0x0000000B
#define _IC8CON1_ICTSEL1_MASK                    0x00000800
#define _IC8CON1_ICTSEL1_LENGTH                  0x00000001

#define _IC8CON1_ICTSEL2_POSITION                0x0000000C
#define _IC8CON1_ICTSEL2_MASK                    0x00001000
#define _IC8CON1_ICTSEL2_LENGTH                  0x00000001

#define _IC8CON2_SYNCSEL_POSITION                0x00000000
#define _IC8CON2_SYNCSEL_MASK                    0x0000001F
#define _IC8CON2_SYNCSEL_LENGTH                  0x00000005

#define _IC8CON2_TRIGSTAT_POSITION               0x00000006
#define _IC8CON2_TRIGSTAT_MASK                   0x00000040
#define _IC8CON2_TRIGSTAT_LENGTH                 0x00000001

#define _IC8CON2_ICTRIG_POSITION                 0x00000007
#define _IC8CON2_ICTRIG_MASK                     0x00000080
#define _IC8CON2_ICTRIG_LENGTH                   0x00000001

#define _IC8CON2_IC32_POSITION                   0x00000008
#define _IC8CON2_IC32_MASK                       0x00000100
#define _IC8CON2_IC32_LENGTH                     0x00000001

#define _IC8CON2_SYNCSEL0_POSITION               0x00000000
#define _IC8CON2_SYNCSEL0_MASK                   0x00000001
#define _IC8CON2_SYNCSEL0_LENGTH                 0x00000001

#define _IC8CON2_SYNCSEL1_POSITION               0x00000001
#define _IC8CON2_SYNCSEL1_MASK                   0x00000002
#define _IC8CON2_SYNCSEL1_LENGTH                 0x00000001

#define _IC8CON2_SYNCSEL2_POSITION               0x00000002
#define _IC8CON2_SYNCSEL2_MASK                   0x00000004
#define _IC8CON2_SYNCSEL2_LENGTH                 0x00000001

#define _IC8CON2_SYNCSEL3_POSITION               0x00000003
#define _IC8CON2_SYNCSEL3_MASK                   0x00000008
#define _IC8CON2_SYNCSEL3_LENGTH                 0x00000001

#define _IC8CON2_SYNCSEL4_POSITION               0x00000004
#define _IC8CON2_SYNCSEL4_MASK                   0x00000010
#define _IC8CON2_SYNCSEL4_LENGTH                 0x00000001

#define _QEI1CON_CCM_POSITION                    0x00000000
#define _QEI1CON_CCM_MASK                        0x00000003
#define _QEI1CON_CCM_LENGTH                      0x00000002

#define _QEI1CON_GATEN_POSITION                  0x00000002
#define _QEI1CON_GATEN_MASK                      0x00000004
#define _QEI1CON_GATEN_LENGTH                    0x00000001

#define _QEI1CON_CNTPOL_POSITION                 0x00000003
#define _QEI1CON_CNTPOL_MASK                     0x00000008
#define _QEI1CON_CNTPOL_LENGTH                   0x00000001

#define _QEI1CON_INTDIV_POSITION                 0x00000004
#define _QEI1CON_INTDIV_MASK                     0x00000070
#define _QEI1CON_INTDIV_LENGTH                   0x00000003

#define _QEI1CON_IMV_POSITION                    0x00000008
#define _QEI1CON_IMV_MASK                        0x00000300
#define _QEI1CON_IMV_LENGTH                      0x00000002

#define _QEI1CON_PIMOD_POSITION                  0x0000000A
#define _QEI1CON_PIMOD_MASK                      0x00001C00
#define _QEI1CON_PIMOD_LENGTH                    0x00000003

#define _QEI1CON_QEISIDL_POSITION                0x0000000D
#define _QEI1CON_QEISIDL_MASK                    0x00002000
#define _QEI1CON_QEISIDL_LENGTH                  0x00000001

#define _QEI1CON_QEIEN_POSITION                  0x0000000F
#define _QEI1CON_QEIEN_MASK                      0x00008000
#define _QEI1CON_QEIEN_LENGTH                    0x00000001

#define _QEI1IOC_QEA_POSITION                    0x00000000
#define _QEI1IOC_QEA_MASK                        0x00000001
#define _QEI1IOC_QEA_LENGTH                      0x00000001

