Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256GM304.h
#define _RPINR27_U3CTSR0_POSITION                0x00000008
#define _RPINR27_U3CTSR0_MASK                    0x00000100
#define _RPINR27_U3CTSR0_LENGTH                  0x00000001

#define _RPINR27_U3CTSR1_POSITION                0x00000009
#define _RPINR27_U3CTSR1_MASK                    0x00000200
#define _RPINR27_U3CTSR1_LENGTH                  0x00000001

#define _RPINR27_U3CTSR2_POSITION                0x0000000A
#define _RPINR27_U3CTSR2_MASK                    0x00000400
#define _RPINR27_U3CTSR2_LENGTH                  0x00000001

#define _RPINR27_U3CTSR3_POSITION                0x0000000B
#define _RPINR27_U3CTSR3_MASK                    0x00000800
#define _RPINR27_U3CTSR3_LENGTH                  0x00000001

#define _RPINR27_U3CTSR4_POSITION                0x0000000C
#define _RPINR27_U3CTSR4_MASK                    0x00001000
#define _RPINR27_U3CTSR4_LENGTH                  0x00000001

#define _RPINR27_U3CTSR5_POSITION                0x0000000D
#define _RPINR27_U3CTSR5_MASK                    0x00002000
#define _RPINR27_U3CTSR5_LENGTH                  0x00000001

#define _RPINR27_U3CTSR6_POSITION                0x0000000E
#define _RPINR27_U3CTSR6_MASK                    0x00004000
#define _RPINR27_U3CTSR6_LENGTH                  0x00000001

#define _RPINR28_U4RXR_POSITION                  0x00000000
#define _RPINR28_U4RXR_MASK                      0x0000007F
#define _RPINR28_U4RXR_LENGTH                    0x00000007

#define _RPINR28_U4CTSR_POSITION                 0x00000008
#define _RPINR28_U4CTSR_MASK                     0x00007F00
#define _RPINR28_U4CTSR_LENGTH                   0x00000007

#define _RPINR28_U4RXR0_POSITION                 0x00000000
#define _RPINR28_U4RXR0_MASK                     0x00000001
#define _RPINR28_U4RXR0_LENGTH                   0x00000001

#define _RPINR28_U4RXR1_POSITION                 0x00000001
#define _RPINR28_U4RXR1_MASK                     0x00000002
#define _RPINR28_U4RXR1_LENGTH                   0x00000001

#define _RPINR28_U4RXR2_POSITION                 0x00000002
#define _RPINR28_U4RXR2_MASK                     0x00000004
#define _RPINR28_U4RXR2_LENGTH                   0x00000001

#define _RPINR28_U4RXR3_POSITION                 0x00000003
#define _RPINR28_U4RXR3_MASK                     0x00000008
#define _RPINR28_U4RXR3_LENGTH                   0x00000001

#define _RPINR28_U4RXR4_POSITION                 0x00000004
#define _RPINR28_U4RXR4_MASK                     0x00000010
#define _RPINR28_U4RXR4_LENGTH                   0x00000001

#define _RPINR28_U4RXR5_POSITION                 0x00000005
#define _RPINR28_U4RXR5_MASK                     0x00000020
#define _RPINR28_U4RXR5_LENGTH                   0x00000001

#define _RPINR28_U4RXR6_POSITION                 0x00000006
#define _RPINR28_U4RXR6_MASK                     0x00000040
#define _RPINR28_U4RXR6_LENGTH                   0x00000001

#define _RPINR28_U4CTSR0_POSITION                0x00000008
#define _RPINR28_U4CTSR0_MASK                    0x00000100
#define _RPINR28_U4CTSR0_LENGTH                  0x00000001

#define _RPINR28_U4CTSR1_POSITION                0x00000009
#define _RPINR28_U4CTSR1_MASK                    0x00000200
#define _RPINR28_U4CTSR1_LENGTH                  0x00000001

#define _RPINR28_U4CTSR2_POSITION                0x0000000A
#define _RPINR28_U4CTSR2_MASK                    0x00000400
#define _RPINR28_U4CTSR2_LENGTH                  0x00000001

#define _RPINR28_U4CTSR3_POSITION                0x0000000B
#define _RPINR28_U4CTSR3_MASK                    0x00000800
#define _RPINR28_U4CTSR3_LENGTH                  0x00000001

#define _RPINR28_U4CTSR4_POSITION                0x0000000C
#define _RPINR28_U4CTSR4_MASK                    0x00001000
#define _RPINR28_U4CTSR4_LENGTH                  0x00000001

#define _RPINR28_U4CTSR5_POSITION                0x0000000D
#define _RPINR28_U4CTSR5_MASK                    0x00002000
#define _RPINR28_U4CTSR5_LENGTH                  0x00000001

#define _RPINR28_U4CTSR6_POSITION                0x0000000E
#define _RPINR28_U4CTSR6_MASK                    0x00004000
#define _RPINR28_U4CTSR6_LENGTH                  0x00000001

#define _RPINR29_SDI3R_POSITION                  0x00000000
#define _RPINR29_SDI3R_MASK                      0x0000007F
#define _RPINR29_SDI3R_LENGTH                    0x00000007

#define _RPINR29_SCK3R_POSITION                  0x00000008
#define _RPINR29_SCK3R_MASK                      0x00007F00
#define _RPINR29_SCK3R_LENGTH                    0x00000007

#define _RPINR29_SDI3R0_POSITION                 0x00000000
#define _RPINR29_SDI3R0_MASK                     0x00000001
#define _RPINR29_SDI3R0_LENGTH                   0x00000001

#define _RPINR29_SDI3R1_POSITION                 0x00000001
#define _RPINR29_SDI3R1_MASK                     0x00000002
#define _RPINR29_SDI3R1_LENGTH                   0x00000001

#define _RPINR29_SDI3R2_POSITION                 0x00000002
#define _RPINR29_SDI3R2_MASK                     0x00000004
#define _RPINR29_SDI3R2_LENGTH                   0x00000001

#define _RPINR29_SDI3R3_POSITION                 0x00000003
#define _RPINR29_SDI3R3_MASK                     0x00000008
#define _RPINR29_SDI3R3_LENGTH                   0x00000001

#define _RPINR29_SDI3R4_POSITION                 0x00000004
#define _RPINR29_SDI3R4_MASK                     0x00000010
#define _RPINR29_SDI3R4_LENGTH                   0x00000001

#define _RPINR29_SDI3R5_POSITION                 0x00000005
#define _RPINR29_SDI3R5_MASK                     0x00000020
#define _RPINR29_SDI3R5_LENGTH                   0x00000001

#define _RPINR29_SDI3R6_POSITION                 0x00000006
#define _RPINR29_SDI3R6_MASK                     0x00000040
#define _RPINR29_SDI3R6_LENGTH                   0x00000001

#define _RPINR29_SCK3R0_POSITION                 0x00000008
#define _RPINR29_SCK3R0_MASK                     0x00000100
#define _RPINR29_SCK3R0_LENGTH                   0x00000001

#define _RPINR29_SCK3R1_POSITION                 0x00000009
#define _RPINR29_SCK3R1_MASK                     0x00000200
#define _RPINR29_SCK3R1_LENGTH                   0x00000001

#define _RPINR29_SCK3R2_POSITION                 0x0000000A
#define _RPINR29_SCK3R2_MASK                     0x00000400
#define _RPINR29_SCK3R2_LENGTH                   0x00000001

#define _RPINR29_SCK3R3_POSITION                 0x0000000B
#define _RPINR29_SCK3R3_MASK                     0x00000800
#define _RPINR29_SCK3R3_LENGTH                   0x00000001

#define _RPINR29_SCK3R4_POSITION                 0x0000000C
#define _RPINR29_SCK3R4_MASK                     0x00001000
#define _RPINR29_SCK3R4_LENGTH                   0x00000001

#define _RPINR29_SCK3R5_POSITION                 0x0000000D
#define _RPINR29_SCK3R5_MASK                     0x00002000
#define _RPINR29_SCK3R5_LENGTH                   0x00000001

#define _RPINR29_SCK3R6_POSITION                 0x0000000E
#define _RPINR29_SCK3R6_MASK                     0x00004000
#define _RPINR29_SCK3R6_LENGTH                   0x00000001

